homework-5.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Homework 5</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a> &nbsp; &nbsp;
          <!-- Plupper Button -->
          <div id="plupperButton" style="display: inline;"></div>
          <!-- End of Plupper Button Code -->
</div>
<div id="content">
<h1 class="title">Homework 5</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Task 1 (10 pts)</a></li>
<li><a href="#sec-2">Task 2 (10 pts)</a></li>
<li><a href="#sec-3">Task 3 (80 pts)</a>
<ul>
<li><a href="#sec-3-1">Possible pseudo-code</a></li>
</ul>
</li>
<li><a href="#sec-4">Extra credit (30 pts)</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Task 1 (10 pts)</h2>
<div class="outline-text-2" id="text-1">
<p>
Refer to the <a href="./bayesian-inference.html">Bayesian inference notes</a>. Calculate whether it is more
probable that a patient has a cavity or gum disease given he/she has a
toothache. Show your work.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Task 2 (10 pts)</h2>
<div class="outline-text-2" id="text-2">
<p>
Using the "helpful software" at the bottom of the <a href="./bayesian-inference.html">Bayesian inference
notes</a>, load the fire alarm network problem, and determine which is
more probable, given that a fire has been reported: the smoke detector
was tampered with, or there is a fire. Give the probabilities of these
two events.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Task 3 (80 pts)</h2>
<div class="outline-text-2" id="text-3">
<p>
Perform <a href="./naive-bayesian.html">naïve Bayesian classification</a> on a spam/ham dataset. Report
the average experimental f-score after training/testing on 10 random
subsamples, where a random 90% serves as the training set and the
remainder serves as the test set.
</p>

<p>
Use the lemmatized, stopword-removed "Ling-Spam" dataset available in
<a href="./downloads/lingspam_lemm_stop.zip">lingspam_lemm_stop.zip</a>. Original source:
<a href="http://csmining.org/index.php/ling-spam-datasets.html">http://csmining.org/index.php/ling-spam-datasets.html</a>
</p>

<p>
Submit your code to the dropbox. <b>Do not include the dataset in your
submission!</b> If your program is non-typical Java or C++ code, explain
in a <code>README.TXT</code> how to compile and run it. 
</p>

<p>
<b>Important</b>: Your code must open the <code>listing.txt</code> and other data
files from a folder called <code>data</code>.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Possible pseudo-code</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The challenge with this assignment is not the math but getting all the
data needed to compute. As is often the case in AI research, the
mathematics are simple but the algorithm, particularly the collection
and processing of data, is the real challenge.
</p>

<p>
In the aim of possibly helping you along, here is some pseudo-code:
</p>

<pre class="example">
Task 1. Set up global variables.

- create a map for di values, with keys = strings and values = ints
  (this map has words as keys; the value for a word is the number of
  documents across all categories that have this word anywhere in the
  document)

- create several maps for dci values (strings -&gt; ints again, like the
  di map; these maps record the number of documents in a particular
  category that have a particular word); perhaps you can put these
  maps in another map, like so: dci[category][word] = #; in C++,
  that's map&lt;string, map&lt;string, int&gt; &gt;
             (cat)       (word)  (# of docs)

Task 2. Read the text documents.

- open the listing.txt file
- loop: for each line in the listing.txt file
  - read the first "word" -- this is a file name (without the .txt)
  - read the rest of the line from the listing.txt file (the
    number of categories and the categories themselves)
    - record this category information for the document; how will you
      do this?
  - open the document .txt file
  - create a document map D with keys = strings and values =
    true/false or 1/0 (this map will represent the document; the
    strings are words from the document, and the true/false means the
    document does or does not have that word; of course, we don't need
    to put words in the map that the document does not have, just
    words it does, so only true's will be in the map, not false's; you
    might prefer to use a set of strings rather than a map)
  - loop: for each word in the document
    - read the next word from the .txt file
    - record this word in the document map D
  - close the .txt file
  - put this document map D in a vector to collect all such D's

Task 3. Separate the docs into a test set and a training set. Do this
10 times, always taking a random 90% of the documents to serve as a
training set, the other 10% to serve as the testing set.

*Do all of the following 10 times, once for each random
subsample. Average the f-scores.*

Task 4. Reset di and dci values.

- loop: for each document in the training set
  - loop: for each word in the doc map
    - increment in the global di map the number of occurrences of
      documents with this word (because one more document has this
      word)
    - loop: for each category that this document is a member of
      - increment in the global dci map the value for this word in
        this category

Task 5. Classify each testing document

- set up variables for true positive, false positive, false negative
  counts
- loop: for each testing document:
  - figure out which category maximizes the final formula in the
    Bayesian methods notes...
- collect the f-score for this testing set

Task 6. Report the average f-score across the 10 random subsamples.
</pre>

<p>
This is a chunk of C++ that you may find useful for this task. It only
processes the <code>listing.txt</code> file, and does not do any machine
learning.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #000000; background-color: #ffffff; font-weight: bold;">#include</span> <span style="color: #670088; background-color: #ffffff; font-style: italic;">&lt;fstream&gt;</span>
<span style="color: #000000; background-color: #ffffff; font-weight: bold;">#include</span> <span style="color: #670088; background-color: #ffffff; font-style: italic;">&lt;string&gt;</span>

<span style="color: #00005d; background-color: #ffffff; font-style: italic;">// </span><span style="color: #00005d; background-color: #ffffff; font-style: italic;">...</span>

<span style="color: #004dd0; background-color: #ffffff;">string</span> <span style="color: #000000; background-color: #ffffff;">docfile</span>, <span style="color: #000000; background-color: #ffffff;">category</span>, <span style="color: #000000; background-color: #ffffff;">word</span>;
<span style="color: #004dd0; background-color: #ffffff;">int</span> <span style="color: #000000; background-color: #ffffff;">category_count</span>;
<span style="color: #004dd0; background-color: #ffffff;">ifstream</span> <span style="color: #000000; background-color: #ffffff;">f</span>, <span style="color: #000000; background-color: #ffffff;">df</span>;
f.open(<span style="color: #670088; background-color: #ffffff; font-style: italic;">"listing.txt"</span>);
<span style="color: #004dd0; background-color: #ffffff;">while</span>(!f.eof()) { <span style="color: #00005d; background-color: #ffffff; font-style: italic;">// </span><span style="color: #00005d; background-color: #ffffff; font-style: italic;">eof() is true if the file is finished</span>
    f &gt;&gt; docfile;

    <span style="color: #00005d; background-color: #ffffff; font-style: italic;">// </span><span style="color: #00005d; background-color: #ffffff; font-style: italic;">maybe more than 1 category; not in the spam data, but in other</span>
    <span style="color: #00005d; background-color: #ffffff; font-style: italic;">// </span><span style="color: #00005d; background-color: #ffffff; font-style: italic;">datasets...; the file gives the category count next (an int)</span>
    f &gt;&gt; category_count;
    <span style="color: #00005d; background-color: #ffffff; font-style: italic;">// </span><span style="color: #00005d; background-color: #ffffff; font-style: italic;">now get each category for this docfile</span>
    <span style="color: #004dd0; background-color: #ffffff;">for</span>(<span style="color: #004dd0; background-color: #ffffff;">int</span> <span style="color: #000000; background-color: #ffffff;">i</span> = 0; i &lt; category_count; i++) {
        f &gt;&gt; category;
        <span style="color: #00005d; background-color: #ffffff; font-style: italic;">// </span><span style="color: #00005d; background-color: #ffffff; font-style: italic;">do something with category</span>
    }
    <span style="color: #00005d; background-color: #ffffff; font-style: italic;">// </span><span style="color: #00005d; background-color: #ffffff; font-style: italic;">open docfile, process it a word at a time</span>
    df.open(docfile.c_str()); <span style="color: #00005d; background-color: #ffffff; font-style: italic;">// </span><span style="color: #00005d; background-color: #ffffff; font-style: italic;">c_str() is just a funky C++ thing</span>
    <span style="color: #004dd0; background-color: #ffffff;">while</span>(!df.eof()) {
        df &gt;&gt; word;
        <span style="color: #00005d; background-color: #ffffff; font-style: italic;">// </span><span style="color: #00005d; background-color: #ffffff; font-style: italic;">do something with word</span>
    }
    df.close()

    <span style="color: #00005d; background-color: #ffffff; font-style: italic;">// </span><span style="color: #00005d; background-color: #ffffff; font-style: italic;">done with that line of listing.txt</span>
}
f.close()
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Extra credit (30 pts)</h2>
<div class="outline-text-2" id="text-4">
<p>
Make a copy of your code, rename it, and modify it so it trains on all
the documents. Then, save the resulting data (the "model") to a
file. Write another program (or expand this original program) so that
a user can predict the category (spam/ham) on a new, unseen document
which is specified on the command line. Usage should be like this:
</p>

<pre class="example">
bayes-train.exe mymodel                  ;; saves the model
bayes-predict.ext mymodel mydoc.txt      ;; predicts using the model
</pre>

<p>
There should be no output from <code>bayes-train.exe</code> and the only output
from <code>bayes-predict.exe</code> should be the predicted category (spam/ham).
</p>

<div style="font-size: 80%; clear: both;"> <span
xmlns:dct="http://purl.org/dc/terms/"
href="http://purl.org/dc/dcmitype/Text" property="dct:title"
rel="dct:type">Intro to AI material</span> by <a
xmlns:cc="http://creativecommons.org/ns#"
href="http://cse3521.artifice.cc" property="cc:attributionName"
rel="cc:attributionURL">Joshua Eckroth</a> is licensed under a <a
rel="license"
href="http://creativecommons.org/licenses/by-sa/3.0/">Creative Commons
Attribution-ShareAlike 3.0 Unported License</a>. Source code for this
website available at <a
href="https://github.com/joshuaeckroth/cse3521-website">GitHub</a>.
</div>

<!-- Plupper Tracking Code -->
<script src="https://www.google.com/jsapi"></script>
<script type="text/javascript"
    src="https://static.plupper.com/js/plupper.js"></script>
<script type="text/javascript">
    plupper.init("joshuaeckroth@plupper.com");
    plupper.enableCobrowsing();
</script>
<!-- End of Plupper Tracking Code -->

<script src="http://code.jquery.com/jquery-1.9.1.js"></script>
<script src="http://code.jquery.com/ui/1.10.3/jquery-ui.js"></script>

<script type="text/javascript">
$('.hidden .hidden-content').hide();
$('.hidden > strong').click(function() {
  $(this).parent().find('.hidden-content').toggle();
});
</script>
</div>
</div>
</div>
</body>
</html>
